/*
У циклі програма запитує у користувача на введення два числа і
виводить результат їх множення. 
Після виводу результату множення програма запитує про необхідність завершення виконання.
Якщо користувач вводить число 1, то програма завершує цикл.
Якщо введено будь-яке інше число, то програма повторює запит у користувача двох чисел і перемножує їх.
 */
// Імпортування класу Scanner
import java.util.Scanner;

// Клас Main
public class Main 
{
    public static void main(String[] args) 
    {
        // створюємо об'єкт scanner класу Scanner для зчитування введення з консолі
        Scanner scanner = new Scanner(System.in);
        // оголошуємо змінні, що будуть використовуватися в програмі
        int num1, num2, result;
        // починаємо нескінченний цикл, що буде працювати доки не буде зупинено за допомогою break
        while (true) 
        {
            // виводимо запит на введення першого числа
            System.out.print("Введіть перше число: ");
            // зчитуємо введене користувачем перше число
            num1 = scanner.nextInt();
            // виводимо запит на введення другого числа
            System.out.print("Введіть друге число: ");
            // зчитуємо введене користувачем друге число
            num2 = scanner.nextInt();
            // обчислюємо добуток введених чисел
            result = num1 * num2;
            // виводимо на екран результат множення введених чисел
            System.out.println("Результат множення: " + result);
            // виводимо запит на продовження виконання програми
            System.out.print("Продовжити виконання програми? (1 - так, інше - ні): ");
            // зчитуємо введення користувача
            int input = scanner.nextInt();
            // якщо користувач ввів 1, то
            if (input == 1) 
            {
                // вийти з циклу while, тобто закінчити виконання програми
                break;
            }
        }
    }
}